#Визначити найбільшу з цифр, використовуваних в десятковому запису заданого чотиризначного натурального числа nnum = str(input("Введіть чотиризначне натуральне число: "))
num = str(input("Введіть чотиризначне натуральне число: "))

while len(num) < 4 or len(num) > 4 or num.isdigit() == 0:

    num = str(input("Введіть число ще раз, так як воно не чотиризначне або це не число: "))

max_num=num[0]

for i in range (len(num)):
    if max_num < num[i]:
        max_num= num[i]

print("Найбільша цифра:", max_num)