#Реалізувати одновимірний масив, довжину масива та сам масив користувач має ввести з клавіатури.
#Варіант 9. Дано одномірний масив, що складається з N цілочисельних елементів. Масив користувач має ввести з клавіатури.
#Знайти суму всіх елементів масиву з парними індексами.
n=int(input("Введіть розмір одновимірного масиву: "))
mas=[]
for i in range(0,n):

    while True:
        element = (input(f"x[{i}]= "))
        try:
            mas.append(int(element))
            break
        except ValueError:
            print("Помилка! Це не число, введіть ще раз: ")
sum_elements = 0
for i in range(0,n, 2):
    sum_elements = sum_elements + mas[i]
print(f"Сума всіх парних за індексами елементів = {sum_elements}")