#Реалізувати функцію, яка виконує операції над множинами – задану за варіантом та друк множини на екран.
#У випадку, якщо задану варіантом операцію над множиною виконати не можна,
#перетворіть множину у список, а потім при виведенні на екран результуючий список перетворіть на множину.
#9. Маємо множину символів {c, d}. Скласти програму, яка додає до цієї множини множину усіх цифр.
def grouping():
    symbols={"c","d"}
    numbers={str(num) for num in range(0,10)}
    matching= symbols|numbers
    print(matching)


grouping()
